#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gcs_api_extract.random_id.bucket_suffix: Refreshing state... [id=i_k]
random_password.flyte_db_password: Refreshing state... [id=none]
module.flyte_gcs_backend.random_id.bucket_suffix: Refreshing state... [id=FsY]
google_service_account.user_code_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_project_iam_custom_role.flyte_backend_role: Refreshing state... [id=projects/exemplary-tide-379122/roles/flyteBackendRole]
google_service_account.flyte_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_project_service.compute_api: Refreshing state... [id=exemplary-tide-379122/compute.googleapis.com]
data.google_client_config.default: Reading...
google_project_service.composer_api: Refreshing state... [id=exemplary-tide-379122/composer.googleapis.com]
module.gcs_api_extract.google_storage_bucket.buckets["spotify-web-api-extracts"]: Refreshing state... [id=pricing-aggregator-us-east1-spotify-web-api-extracts]
google_project_service.container_api: Refreshing state... [id=exemplary-tide-379122/container.googleapis.com]
module.gke_auth.data.google_client_config.provider: Reading...
module.flyte_gcs_backend.google_storage_bucket.buckets["flyte-storage-backend"]: Refreshing state... [id=pricing-aggregator-us-east1-flyte-storage-backend]
google_project_service.secret_mgr_api: Refreshing state... [id=exemplary-tide-379122/secretmanager.googleapis.com]
data.google_client_config.default: Read complete after 1s [id=projects/"exemplary-tide-379122"/regions/"us-east1"/zones/<null>]
module.gke_auth.data.google_client_config.provider: Read complete after 1s [id=projects/"exemplary-tide-379122"/regions/"us-east1"/zones/<null>]
module.gcs_api_extract.google_storage_bucket_iam_binding.admins["spotify-web-api-extracts"]: Refreshing state... [id=b/pricing-aggregator-us-east1-spotify-web-api-extracts/roles/storage.objectAdmin]
google_project_iam_member.user_code_role_member: Refreshing state... [id=exemplary-tide-379122/roles/editor/serviceAccount:user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_project_service.cloud_sql_api: Refreshing state... [id=exemplary-tide-379122/sqladmin.googleapis.com]
module.flyte_gcs_backend.google_storage_bucket_iam_binding.admins["flyte-storage-backend"]: Refreshing state... [id=b/pricing-aggregator-us-east1-flyte-storage-backend/roles/storage.objectAdmin]
google_project_iam_binding.flyte_backend_role_binding: Refreshing state... [id=exemplary-tide-379122/projects/exemplary-tide-379122/roles/flyteBackendRole]
google_sql_database_instance.flyte_db_backend: Refreshing state... [id=flyte-db-backend]
google_container_cluster.flyte_cluster: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-cluster]
module.gke_auth.data.google_container_cluster.gke_cluster: Reading...
google_container_node_pool.flyte_node_pool: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-cluster/nodePools/flyte-np]
google_sql_user.flyte_db_user: Refreshing state... [id=postgres//flyte-db-backend]
module.gke_auth.data.google_container_cluster.gke_cluster: Read complete after 0s [id=projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-cluster]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_cluster.flyte_cluster must be replaced
-/+ resource "google_container_cluster" "flyte_cluster" {
      ~ cluster_ipv4_cidr           = "10.0.0.0/14" -> (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      - enable_autopilot            = false -> null
      ~ enable_intranode_visibility = false -> (known after apply)
      - enable_tpu                  = false -> null
      ~ endpoint                    = "35.229.120.217" -> (known after apply)
      ~ id                          = "projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-cluster" -> (known after apply)
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
      ~ logging_service             = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version              = "1.26.5-gke.1200" -> (known after apply)
      ~ monitoring_service          = "monitoring.googleapis.com/kubernetes" -> (known after apply)
        name                        = "flyte-cluster"
      ~ network                     = "projects/exemplary-tide-379122/global/networks/default" -> "default"
      ~ networking_mode             = "ROUTES" -> (known after apply)
      ~ node_locations              = [] -> (known after apply)
      ~ node_version                = "1.26.5-gke.1200" -> (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      ~ project                     = "exemplary-tide-379122" -> (known after apply)
      - resource_labels             = {} -> null
      ~ self_link                   = "https://container.googleapis.com/v1/projects/exemplary-tide-379122/zones/us-east1-b/clusters/flyte-cluster" -> (known after apply)
      ~ services_ipv4_cidr          = "10.3.240.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/exemplary-tide-379122/regions/us-east1/subnetworks/default" -> (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)
        # (8 unchanged attributes hidden)

      - addons_config {
          - gce_persistent_disk_csi_driver_config {
              - enabled = true -> null
            }
          - network_policy_config {
              - disabled = true -> null
            }
        }

      - binary_authorization {
          - enabled = false -> null
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      ~ master_auth {
          ~ client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURvRENDQWdpZ0F3SUJBZ0lRV3ZnU0RhZU1SQ3JicDdIOVB4YU9TakFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlRNU1XSmtPRGc0WWkwM1ptRmlMVFE0TkRBdFlqY3laQzAzT0Rnek0ySTJaakU0TVRZdwpIaGNOTWpNd056RTJNVFF3TURVeFdoY05Namd3TnpFME1UUXdNalV4V2pBUk1ROHdEUVlEVlFRREV3WmpiR2xsCmJuUXdnZ0VpTUEwR0NTcUdTSWIzRFFFQkFRVUFBNElCRHdBd2dnRUtBb0lCQVFETEwzaHlFUERjekIzZWZlN1IKMU9VSTV1NExRcHpudHRNRE9wOW4vRkdtMm9lcDJoSytIM1QzdkxhTkZCSzJVQmxBb2N6blJlK0ZxQWRPZTNESgo3Zjl4MzRPZnV4am9XNkJJUFZOL2FpajhzU2E4TlFhZERpbllDdXIyYWQvTStETGFUR2VCNGp1RUVtY20wVzlCCnVpTU5nM09HYTAyajJ4WGRWQjNlenpZQ3AvMWoycFZYR1hWWUp0ci9uWVFaYnJobktOeEZMRVk4c0RFN21xL0cKZUhmU2owSjJKMnJDdUxJZDFmY1FNUm5xYnJsUU1lazNLcmhqcmlraUd4QkFVY3IwbGcyeXNsaGJEUzZaTEVhWQo2Ukc1U1hEUTBiSDhlZDVrRHQ0c1VpVk5menllTDJxYnlwQlVRZDZabjd3MDlERjdpZGJzekNQaTNtR2MrUXJVCjVGOFJBZ01CQUFHalZqQlVNQTRHQTFVZER3RUIvd1FFQXdJRm9EQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBTUJnTlZIUk1CQWY4RUFqQUFNQjhHQTFVZEl3UVlNQmFBRkRuVmMvWWFJNWN3eFRGbENhSkkrSFBGMTh1NApNQTBHQ1NxR1NJYjNEUUVCQ3dVQUE0SUJnUUNFK0lUTUovbVFNcWVETVl2Mlpldm41MDZEYjBxNVc0VHdtRDAyCmZZRS9maksyOHZESmpuSkE0UDJwVlJWaU4rajB5aXU5Uk43RlRERGhMTWQ3Z1doY1YwNDVLZ2gzYVhPM0R6czYKWTNWQ0pVQk9GQ09IM2Y1MGRXWTMxN1ZTL1VwbE5JNVM1K3pwVWNYZEZlWE16cWYxM2FWNnFYeTRDRnZPUi9JZgpEc2pXaG9aWG0rTUpBcmMzYUlaMWlRdGFpb1Y1eGRFMnUzMWNiUmJzV0VlVDV5L3VyRzg4U1JzUlEyLzRHRWd6CnV6YzhTWDhrZWNmbVRrdzc5ekNmVUFOUkxmV0MwY0Z5UUg5aE0xYTFib1F0dWpvOTNERXJ0dmhXOGhRQVNaSjMKS0FWOUpEdnQyNDZYejBhL0VQaHdNN1ZRSURab3FlQkNvbXdlWU1iaTl0YlcvTGZlQ0tUSEM5QUVuYnYyMFAyLwpOVGVQdllKNmRKdkJRZ1BkTTlGYjVYYkdqZjZZQmN4VnFuSkszT3d3YW1HcGNSdzdGNWl0NTBBVEUwRzFmNzdZCm9rUUQxa3hjK0VhSFBrMjhORzQ1cytUa1UzajFLazNDOUZIeWdZUGpsRC8wdzkzVnl1YityYnl4bERkeFNpcTQKTkljM1ZMUFd2cm9rbkR3L1hQUVNVTFBHV1k4PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)
          ~ client_key             = (sensitive value)
          ~ cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMVENDQXBXZ0F3SUJBZ0lSQVBzWW1WT1h6ZnpMM1h1TWFIMVBoZW93RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa09URmlaRGc0T0dJdE4yWmhZaTAwT0RRd0xXSTNNbVF0TnpnNE16TmlObVl4T0RFMgpNQ0FYRFRJek1EY3hOakV6TURJMU1Gb1lEekl3TlRNd056QTRNVFF3TWpVd1dqQXZNUzB3S3dZRFZRUURFeVE1Ck1XSmtPRGc0WWkwM1ptRmlMVFE0TkRBdFlqY3laQzAzT0Rnek0ySTJaakU0TVRZd2dnR2lNQTBHQ1NxR1NJYjMKRFFFQkFRVUFBNElCandBd2dnR0tBb0lCZ1FDdDVRdUZtaTZvaWF6KzhRWm1uRTViQTNpVzQ2cWtiWHRhR3RUSAp2TENGYnRyRVhBUVkzdXdpeWhIQ3NUc1RsL2NlY1B0ZnlZdldJUGFnQ0ZQZDVjdHNLbnM1VHZZZkx5NW5hdmhKCjNHNnZVUUhWN3RVSlluOFNWZWpJTkxyeEVGOFpWRlkwRW5uNUlOT3lsZEYyNWZlak93MXJXcnB6a3JLWTRBWHMKbldTTm1WSG9ib0hsbjYxYnpGVUhhQUFkckF5UjJWc2RlWlRpV3RqTXcxSEVLb1RlZWZxZi9nQzFVRVcyM1AzSQpxY2hVbWpWbWFseDVJL1F1TUFnekZtWTErZktYNThWRnNYUzQzUTRRYjN4bnRSNU5UTCtxNVVRamF4S2RlNTNGCmxCTUxUemc1US95dm1kSEpZMTNDeFU3ekdOSEw4Nkp0VVdySzVoTE9xZmVjTDVmdU9OQU5nSEtoS21SWFp3OFkKNFVPWEthbFlYYkg2R0NEOFRsRzV6emN6VkJnL0JNdGpkb1dJblF1Z1lSOWxEblFKSGJJUUdDYTluODF4NGJ4SApYakc1akJ0UFlDRzZod1NnTlhzdVV4WHNsbVl1bjQvdFNWdC9TMnVsdWs1TGZKRU9ycTVJMVQvc0E3VFF0MXdSCjZHT3dFbEp4MlFZVmRNa2ozTlBRcnVodDZnMENBd0VBQWFOQ01FQXdEZ1lEVlIwUEFRSC9CQVFEQWdJRU1BOEcKQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGRG5WYy9ZYUk1Y3d4VEZsQ2FKSStIUEYxOHU0TUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQmdRQ1pGYjVZeFhtcDhNbGZqbUpieXNUbjkrSVZZNStCTnM5cUtSQXhPekdOCkkwejFuUVFoWHh3ZCszQ0xRcnVla0RPU0dXZWFaMGtHUlEraU1Ta0Q1Z1NVQWJON1Q0YWpaa0VDK1YwVDFJQ1IKQjJ3ZjU5Q2hpOUN4TllzelhXNENoU3VlNkRGMkJ2MDcrQVJKcTA3eVQ0cmdkdnpPRjMvWGRPc0pSRDJ5Nm5oSApGSlpZcGswUHd2OEYrTkZoSWswb0pISFIxMHhNeGxqb1VzVWRlWUxLaUdrd0E2RTNVS2EzSExUWUFjRzcva0tnCk5CZ0xoWlZZM3VSSEtENk4vVmVpT2tOWGtXNk9Vbm55KzREd3N4UHhWNG1LV1FsS3dKbkkxdHBGWGp3UW4xanAKMEgrM0dvd1ZabENmREVuZ1hVWE1kTnhlbHFVN2w4UjZSWTRXM01xa0R2dXlYSkE2Q0tsYmNWeDYxRXpKcnJoZgpCc1JIOFlHdGNJV3gxeUg4YWJpUjkxVzlvQUJROTFPVlJhdmRIb2wrb1d0Z1BLdkkzWWFxYWhpMEdEckVMM0owCmZXWGkrbXB3OUNiK09CaE00c3p2bmdqZFBDQUl1OWllWUo5ZFdVeWJTbk03dmk2dVpVZGJ5MW9vZytOR3R3cysKcXhTM2haZzhvY2pIQjJwaHRyR28wN2c9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)

          ~ client_certificate_config {
              ~ issue_client_certificate = true -> false # forces replacement
            }
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> null
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      + node_config { # forces replacement
          + disk_size_gb      = 10 # forces replacement
          + disk_type         = "pd-balanced" # forces replacement
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = false # forces replacement
          + service_account   = (known after apply)
          + spot              = false # forces replacement
          + taint             = (known after apply)

          + ephemeral_storage_local_ssd_config { # forces replacement
              + local_ssd_count = 0 # forces replacement
            }
        }

      - node_pool_defaults {
          - node_config_defaults {
              - logging_variant = "DEFAULT" -> null
            }
        }

      - notification_config {
          - pubsub {
              - enabled = false -> null
            }
        }

      - private_cluster_config {
          - enable_private_endpoint = false -> null
          - enable_private_nodes    = false -> null
          - private_endpoint        = "10.142.0.51" -> null
          - public_endpoint         = "35.229.120.217" -> null

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      - release_channel {
          - channel = "REGULAR" -> null
        }

      - security_posture_config {
          - mode               = "MODE_UNSPECIFIED" -> null
          - vulnerability_mode = "VULNERABILITY_MODE_UNSPECIFIED" -> null
        }

      - service_external_ips_config {
          - enabled = false -> null
        }
    }

  # google_container_node_pool.flyte_node_pool will be created
  + resource "google_container_node_pool" "flyte_node_pool" {
      + cluster                     = "flyte-cluster"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-east1-b"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "flyte-np"
      + name_prefix                 = (known after apply)
      + node_count                  = 2
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "e2-micro"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com"
          + spot              = false
          + taint             = (known after apply)
        }
    }

  # helm_release.flyte_single_cluster will be created
  + resource "helm_release" "flyte_single_cluster" {
      + atomic                     = false
      + chart                      = "flyte-binary"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "flyte-test-setup"
      + namespace                  = "flyte"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://flyteorg.github.io/flyte"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.8.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kevinsunny1996, Action: `pull_request`*